{
  "story": [
    {
      "type": "header",
      "text": "Mohamed Salah's Liverpool Future in Doubt After Incendiary Interview and Club Reaction"
    },
    {
      "type": "paragraph",
      "text": "Mohamed Salah's future at Liverpool has been plunged into doubt following an \"incendiary interview\" he gave at Leeds. After being benched for a third consecutive game, Salah accused the club of \"throwing him under a bus\" and claimed his relationship with head coach Arne Slot had broken down."
    },
    {
      "type": "paragraph",
      "text": "In response, Liverpool, in consultation with Slot, decided to remove Salah from the first-team picture for a \"short period.\" This means the 33-year-old forward will miss the Champions League trip to Milan to play Inter on Tuesday and may also be absent for the home game against Brighton on Saturday. The club stated this decision was \"in the best interests of the club, the player and the rest of the squad\" as they seek to correct a damaging run of form."
    },
    {
      "type": "paragraph",
      "text": "Speaking publicly for the first time on Monday, Arne Slot denied Salah's claims of a broken relationship, stating, \"That is not the way I feel, but he has the right to feel how he feels things.\" Slot expressed surprise at Salah's comments, noting the player had been \"really respectful to the staff and manager, his teammates and he trained very hard.\" He then asserted his authority regarding the club's reaction: \"Usually I’m calm, I’m polite. But that doesn’t mean I’m weak so if a player has these comments about so many things then it’s up to me and the club to react. We reacted in a way you can see – he’s not here.”"
    },
    {
      "type": "paragraph",
      "text": "The head coach remained non-committal on whether Salah, Liverpool's third-highest goalscorer, had played his last game for the club, replying, \"I have no clue. I cannot answer that question at this point in time.\" However, Slot added, \"I am a firm believer that there is always a possibility to return for a player.\" Salah himself had suggested in his interview that he may have played his final game. With 19 months remaining on his £400,000-a-week contract, renewed interest from Saudi Arabian clubs like Al-Ittihad (who made a £150m bid in September 2023) and Al-Hilal is anticipated when the transfer window reopens in January. Salah is scheduled to report for Africa Cup of Nations duty with Egypt next Monday, potentially keeping him away from Liverpool until mid-January."
    },
    {
      "type": "paragraph",
      "text": "Teammates, including first-choice goalkeeper Alisson, have weighed in on the situation. Alisson hoped Salah would play for Liverpool again, describing it as \"a personal situation between Mo and the club,\" but underscored the team's desire for \"the best for the club as well.\" Alisson also affirmed the squad's strong support for Slot amidst a \"miserable run of results,\" stating, \"We believe in his knowledge. We believe in his style of play and that he is capable of helping us to turn around this situation.\" This sentiment was echoed by Virgil van Dijk earlier, who said of players, “It’s not like you have unlimited credit, everyone has to perform.” The Egyptian Football Association also sent a message of support to Salah on social media on Sunday."
    },
    {
      "type": "paragraph",
      "text": "Former Liverpool defender Jamie Carragher heavily criticized Salah on Sky Sports on Monday night, suggesting the timing of the interview was calculated to \"go for the manager and maybe get him sacked\" following a poor result. Carragher reminded Salah that \"before he came to Liverpool he was known as the man who failed at Chelsea.\" The incident has drawn comparisons to Roy Keane’s infamous MUTV interview, which led to his dismissal from Manchester United."
    },
    {
      "type": "paragraph",
      "text": "The current upheaval comes as Liverpool struggles with a series of self-inflicted problems this season, despite having spent nearly £450m on a team that won the Premier League comfortably last season. They have conceded 10 league goals from set pieces, including Ao Tanaka's 96th-minute equalizer for Leeds, and face a depleted squad for the Inter game due to illness and injury to players like Cody Gakpo, Federico Chiesa (who could fly out if he recovers from illness), and Wataru Endo, leaving Slot with just 19 players, including three goalkeepers and three teenagers."
    }
  ]
}