{
  "title": "Reeves Unveils Budget Strategy: Blaming Brexit, Targeting Wealthy & Welfare, Boosting Business",
  "topic": "Reeves sets budget agenda: Brexit blame, welfare cuts, higher wealthy taxes, and business reforms.",
  "story": "Chancellor Rachel Reeves is preparing for a crucial budget statement on November 26, grappling with a growing shortfall in public finances. She has squarely attributed a significant portion of the economic challenges to the 'heavier than anticipated blow' from Brexit, alongside the lingering impact of austerity and Liz Truss's mini-budget. Reeves anticipates a 'sharp downgrade in growth forecasts' from the independent Office for Budget Responsibility (OBR).\n\nIn response to these fiscal pressures, Reeves has stated that 'tax rises and spending cuts are on the table.' She emphasized that welfare cannot be left 'untouched,' with the Treasury reportedly considering cutting up to £1 billion in tax breaks for a scheme providing cars for disabled people. The Institute for Fiscal Studies (IFS) has urged the Chancellor to consider 'billions of pounds in welfare cuts' to address a potential £22 billion shortfall and reassure financial markets.\n\nWhile attending the annual meetings of the International Monetary Fund (IMF) in Washington D.C., Reeves confirmed that higher taxes on the wealthy would form part of her budget strategy, stating that those with the 'broadest shoulders' should pay their 'fair share.' She also promised a new package of anti-inflation measures, following an IMF warning that UK consumers are expected to face the highest price rises in the G7 this year and next. Reeves asserted there 'won’t be a return to austerity,' shrugging off criticism as 'scaremongering.'\n\nAdditionally, the Chancellor is set to launch a 'blitz on business bureaucracy' to save companies £6 billion. Speaking to business leaders in Birmingham, she outlined plans to 'cut pointless admin,' including scrapping the requirement for directors of small firms to file a directors' report with Companies House, a measure expected to benefit over 100,000 small businesses.",
  "figure": [
    "Rachel Reeves",
    "Liz Truss"
  ],
  "video": [
    "https://www.youtube.com/embed/dQw4w9WgXcQ",
    "https://www.youtube.com/embed/xcO2z9vG2eY"
  ],
  "location": [
    {
      "name": "Washington D.C.",
      "lat": 38.9072,
      "lon": -77.0369
    },
    {
      "name": "Birmingham",
      "lat": 52.4862,
      "lon": -1.8904
    }
  ]
}