{
  "title": "NHS Maternity Crisis: Birth Injuries Surge as Negligence Costs Hit £60 Billion",
  "topic": "NHS maternity services face rising birth injuries and soaring medical negligence liabilities.",
  "story": "NHS maternity services in England are grappling with \"deeply troubling failures,\" leading to a significant increase in severe birth injuries for mothers and a staggering £60 billion in medical negligence liabilities. This alarming figure, primarily driven by childbirth injury cases, marks a quadrupling of liabilities from £14.4 billion in 2006-07.\n\nNew data reveals a 16% rise in severe third- and fourth-degree perineal tears experienced by mothers during childbirth, increasing from 25 in 1,000 in June 2020 to 29 in 1,000 by June this year. Such injuries have a \"life-changing\" impact on women's physical and mental health, often causing post-traumatic stress disorder and leaving them fearful of future pregnancies. Experts attribute this rise to poor NHS care, understaffing in maternity units, and an increasing number of older and larger mothers.\n\nThe financial burden on the NHS is immense. The total cost of settling clinical negligence legal actions has soared from £1.1 billion to £3.6 billion over the same period. Childbirth injury cases, particularly those involving babies suffering brain damage during birth, are exceptionally costly, averaging over £11 million each to settle, as awards must cover lifetime care needs. Payments in obstetrics have risen, even as some other medical specialties have seen falling payouts.\n\nA report by the National Audit Office (NAO) highlighted these issues, urging NHS chiefs to do more to prevent harm. The NAO's estimate of £60 billion in negligence liabilities underscores the grave shortcomings widely recognized in maternity care. Furthermore, the report pointed to unjust disparities in outcomes for women from different socioeconomic backgrounds, compounding the crisis in England's maternity services.",
  "figure": [],
  "video": [],
  "location": [
    {
      "name": "England",
      "lat": 52.3555,
      "lon": -1.1743
    }
  ]
}