{
  "title": "Neo-Soul Pioneer D'Angelo Dies at 51, Leaving Enduring Musical Legacy",
  "topic": "R&B icon D'Angelo dies at 51, celebrated for influential neo-soul sound and Grammy-winning career.",
  "story": "Grammy-winning R&B singer D’Angelo, born Michael Eugene Archer, passed away on Tuesday morning, October 14th, 2025, at his New York home. He was 51 and had been privately battling pancreatic cancer. His family released a heartfelt statement, saying, “The shining star of our family has dimmed his light for us in this life… After a prolonged and courageous battle with cancer, we are heartbroken to announce that Michael D’Angelo Archer, known to his fans around the world as D’Angelo, has been called home.”\n\nD’Angelo was a seminal figure in the \"neo-soul\" movement, pioneering a forward-looking sound that blended elements of funk, jazz, and hip-hop. Despite releasing only three albums over two decades between 1995 and 2014, his influence stretched far beyond the genre he helped define. His debut album, \"Brown Sugar,\" released in the mid-90s, yielded Top 40 hits in both the UK and US. His second album, \"Voodoo,\" soared to No. 1 in the US charts and earned him two of his four Grammy Awards. His final album, \"Black Messiah,\" also broke into the Top 10, securing two more Grammys.\n\nHis profound impact was not always immediately recognized, as evidenced by an anecdote from The Roots’ drummer, Questlove. In the mid-90s, Questlove initially dismissed an offer to work on D’Angelo's debut, stating, “I was like, ehhh, soul singers in the 90s – whatever.” However, after the release of \"Brown Sugar,\" Questlove had a radical change of heart. Upon spotting D’Angelo at a Roots show, he deliberately \"thwarted and threw off the entire show\" by playing an obscure Prince drum roll, successfully capturing the attention of the artist who would become a generational talent. D'Angelo leaves behind a powerful musical legacy, celebrated for his innovative contributions to modern R&B and soul.",
  "figure": [
    "D’Angelo (Michael Eugene Archer)",
    "Questlove",
    "Otis Redding",
    "Stevie Wonder",
    "Lou Rawls",
    "Prince"
  ],
  "video": [
    "https://www.youtube.com/embed/videoseries?list=PL4fGSI1pDJn5n4L-0k6r0xQ8E9f6vY2oX",
    "https://www.youtube.com/embed/playlist?list=PLlUj4w3c4U5X1h-5gX6J8J4Q9K2L0M2C7"
  ],
  "location": [
    {
      "name": "New York",
      "lat": 40.7128,
      "lon": -74.006
    },
    {
      "name": "United Kingdom",
      "lat": 55.3781,
      "lon": -3.436
    },
    {
      "name": "United States",
      "lat": 37.0902,
      "lon": -95.7129
    }
  ]
}